#!/bin/sh
# =============================================================================
#  Update CheckSUM
# =============================================================================
#  このスクリプトは bin ディレクトリの各コマンドの SHA512 ハッシュの値を checksum.sha512
#  に出力するスクリプトです。署名はされません。

# -----------------------------------------------------------------------------
#  Constants
# -----------------------------------------------------------------------------
SUCCESS=0
FAILURE=1
NAME_FILE_CHECKSUM="checksum.sha512"

PATH_DIR_REPO="$(dirname "$(cd "$(dirname "$0")" && pwd)")"
PATH_DIR_RETURN="$(cd . && pwd)"
PATH_DIR_BIN="${PATH_DIR_REPO}/bin"
PATH_FILE_CHECKSUM="${PATH_DIR_BIN}/${NAME_FILE_CHECKSUM}"

# -----------------------------------------------------------------------------
#  Setup
# -----------------------------------------------------------------------------
cd "$PATH_DIR_BIN" || {
    echo >&2 "ディレクトリの移動に失敗しました。bin ディレクトリに移動できません。"

    exit $FAILURE
}
trap 'cd "$PATH_DIR_RETURN"' 0

# -----------------------------------------------------------------------------
#  Functions
# -----------------------------------------------------------------------------
verifyChecksum() {
    result=$(sha512sum --check "$PATH_FILE_CHECKSUM") || {
        echo >&2 "$result"

        return $FAILURE
    }

    return $SUCCESS
}

# -----------------------------------------------------------------------------
#  Main
# -----------------------------------------------------------------------------
# ハッシュ値の照合
printf "%s" "- ハッシュ値を照合します ... "
verifyChecksum || {
    echo >&2 "* エラー：ハッシュ値の照合に失敗しました。"

    exit $FAILURE
}
echo 'OK'
